firstCrude2D/we123/h10_2/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
 (0 0 0)
 (40 0 0)
 (60 0 0)
 (100 0 0)
 (0 20 0)
 (40 20 0)
 (60 20 0)
 (100 20 0)
 (0 100 0)
 (40 100 0)
 (60 100 0)
 (100 100 0)
 (0 0 10)
 (40 0 10)
 (60 0 10)
 (100 0 10)
 (0 20 10)
 (40 20 10)
 (60 20 10)
 (100 20 10)
 (0 100 10)
 (40 100 10)
 (60 100 10)
 (100 100 10)
);

blocks
(
    hex (0 1 5 4 12 13 17 16) (30 30 1) simpleGrading (0.1 1 1)
    hex (1 2 6 5 13 14 18 17) (30 30 1) simpleGrading (1 1 1)
    hex (2 3 7 6 14 15 19 18) (30 30 1) simpleGrading (10 1 1)
    hex (4 5 9 8 16 17 21 20) (30 30 1) simpleGrading (0.1 1 1)
    hex (5 6 10 9 17 18 22 21) (30 30 1) simpleGrading (1 1 1)
    hex (6 7 11 10 18 19 23 22)(30 30 1) simpleGrading (10 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 12 16 4)
            (4 16 20 8)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (7 19 15 3)
            (11 23 19 7)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 13 12)
	    (1 2 14 13)
	    (2 3 15 14)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (8 20 21 9)
            (9 21 22 10)
            (10 22 23 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
