firstCrude2D/we123/h10_2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       10650;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       10710;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          90;
        startFace       10770;
    }
    atmosphere
    {
        type            patch;
        nFaces          90;
        startFace       10860;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10800;
        startFace       10950;
    }
)

// ************************************************************************* //
